Title: Iterating Through The Rows Of Multiple Columns In Pandas  
Slug: pandas_iterate_over_rows_of_multiple_columns  
Summary: Iterating Through The Rows Of Multiple Columns In Pandas  
Date: 2016-05-01 12:00  
Category: Python  
Tags: Data Wrangling  
Authors: Chris Albon

In [8]:
# Import modules
import pandas as pd
import numpy as np

In [9]:
raw_data = {'first_name': ['Jason', 'Jason', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 36, 24, 73], 
        'preTestScore': [4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Jason    Miller   42             4             25
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

## Iterate Over The Rows Of Two Columns

In [27]:
# Create an empty column for the full names
df['full_name'] = np.NaN

# Create an iteration counter
i = 0

# For each element in first_name and last_name,
for first, last in zip(df['first_name'], df['last_name']):
    # Change the value of the i'th row in full_name 
    # to the combination of the first and last name
    df['full_name'][i] = first + ' ' + last
    
    # Add one to the iteration counter
    i = i+1

In [28]:
# View the dataframe
df

  first_name last_name  age  preTestScore  postTestScore     full_name
0      Jason    Miller   42             4             25  Jason Miller
1      Jason    Miller   42             4             25  Jason Miller
2       Tina       Ali   36            31             57      Tina Ali
3       Jake    Milner   24             2             62   Jake Milner
4        Amy     Cooze   73             3             70     Amy Cooze